{"item2":"Healing Potion","item1":"Iron Sword","item4Description":"A key","room5Description":"A long and narrow hallway, with a floor of solid white marble.  Numerous antique paintings hang on the wall.","room2Description":"Bundles of herbs hang from the ceiling. A large stone oven is built into the north wall. The mixed aroma of burnt wood and fresh herbs linger.","room10Description":"A dark, damp room filled with multiple iron bared cells for holding prisoners. The foundation resembles more of a cavernous system than a stone wall. The smell of death is pungent and overwhelming.","item2Description":"A vial filled with red liquid","room3Description":"The smell of fresh flowers fills the air and the sound of flowing water can be heard.  Four large oak trees sit in each corner surrounded by garden flowers. A hedge-lined path leads to the center of the courtyard where a large water fountain sits.","text3":"Select [1] to start game.","item1Description":"A sharp sword made of the finest iron","text4":"Select [2] to quit game.","text1":"You made it, the castle looks old and abandoned, but is an immaculate piece of architecture. There is an uneasy feeling in the air, a rush of wind picks up the leaves around you. Will you be the first to claim King Berengars treasure? Or will you join the cursed souls that linger within...","text2":"Welcome to Maledictus.  A game created by Lefties.","room5":"Great Hall hallway","room6":"Guard room","room3":"Courtyard","room4":"Ball room","room4Description":"Crystal chandeliers spiral down from the arched sky-blue ceiling illuminating the luxurious golden walls and a floor so polished it looks like an iced-over lake.","room9":"Foyer","room7":"Library","room8":"Secret room","room1":"Dining room","room1Description":"A long, rectangular dining table set with the finest silver cutlery and porcelain tableware fills the room.  A fireplace is built into the east wall behind the head of the table.  A large, crystal chandelier hangs perfectly centered in the room.","room2":"Kitchen","room0":"Great Hall","item3Description":"A sharp pointy spear made of the finest iron","roomDirection1":{"north":"Kitchen","west":"Great Hall"},"roomDirection0":{"east":"Dining room","north":"Courtyard","west":"Great Hall hallway"},"room10":"Dungeon","roomDirection3":{"south":"Great Hall","north":"Ball room"},"room11":"Cellar","roomDirection2":{"south":"Dining room"},"room12":"Crypt","room6Description":"A place where arms and military equipment are stored. You see a ghostly soldier sitting in a wooden chair.","room9Description":"A large, vacant room dimly lit by a few torches lining the stone walls.  You feel an immediate drop in temperature as a freezing chill crawls up your back. You get the sense that this may be your last chance to turn back from what lies ahead...","room11Description":"You see rows of Wine racks as far as the eye can see. A large layer of dust sits atop the exposed wine bottles. You hear a bottle smash in the distance. You are not alone in here...","room7Description":"You see book shelves throughout the room, and at the center of it all, you see a ghostly librarian sitting on the floor with a sea of books scattered around him. He seems to be reading something.","room8Description":"Description placeholder for secret room","roomDirection9":{"east":"Dungeon","south":"Library"},"roomDirection8":{"north":"Library"},"room12Description":"Description placeholder for the crypt.","roomDirection10":{"east":"Crypt","north":"Cellar","west":"Foyer"},"roomDirection5":{"east":"Great Hall","north":"Guard room","west":"Library"},"roomDirection11":{"south":"Dungeon"},"item4":"Brass Key","room0Description":"The main area of the castle.","roomDirection4":{"south":"Courtyard"},"roomDirection12":{"west":"Dungeon"},"item3":"Iron Spear","roomDirection7":{"east":"Great Hall hallway","south":"Secret room","north":"Foyer"},"roomDirection6":{"south":"Great Hall hallway"}}