{"item2":"Healing Potion","item1":"Iron Sword","item4Description":"A key","npc4dialogue":{"dialogue3":"Hey what do you think you're doing? You want a weapon? You could've just asked. But before you do, how about we test out your sword skills with a friendly duel?","dialogue2":"King Berengar was such a great King, he was always so involved in our lives, a genuine and kind man. He would listen to his subjects no matter their status, he really cared about all citizens under his rule. But not anymore.. now he's locked away in his keep, and will not let anyone inside. It's like this castle took on a mind of it's own.. the dead began to come alive, and the living unable to die. Those who were able to leave in time... they suffered the worst fate of all. As soon you step foot outside the castle walls your mind is completely lost while your body slowly begins to rot, now they roam the world aimlessly feasting on other human's flesh, never to be satisfied.","dialogue1":"This castle used to be a beacon of hope, now it's filled with dread. But that was years ago, it's hard to remember what life was like before all of this...madness.","dialogue4":"Certain weapons are more efficient depending on the enemy. A true Warrior is willing to explore all of the options they have at their disposal. Best of luck, this is truly a dangerous place you've come to.."},"room5Description":"A long and narrow hallway, with a floor of solid white marble.  Numerous antique paintings hang on the wall.","room2Description":"Bundles of herbs hang from the ceiling.  A large stone oven is built into the north wall. The mixed aroma of burnt wood and fresh herbs linger.","room10Description":"A dark, damp room filled with multiple iron bared cells for holding prisoners. The foundation resembles more of a cavernous system than a stone wall. The smell of death is pungent and overwhelming.","npc1dialogue2":"Oh my...you've found my wedding ring! Gramercy! You don't know how much trouble and heartache you've put me out of stranger.  I'd like to give you a reward for your kindness. Hale be thou!","item2Description":"A vial filled with red liquid","room3Description":"The smell of fresh flowers fills the air and the sound of flowing water can be heard.  Four large oak trees sit in each corner surrounded by garden flowers. A hedge-lined path leads to the center of the courtyard where a large water fountain sits.","npc3dialogue":{"dialogue2":"Ah yes, an old key you say? hah, I do remember coming across this old thing.  It was sitting right in the middle of this ballroom floor, as if it were placed! stuck out like a sore thumb.  Had it in my pocket ever since.  Here, you can take it off my hands! Go thy way! ","dialogue1":"This room has hosted some of the grandest parties the kingdom has ever known.  Indeed, years and years of delightful memories I have had here.  Now its just a vacant, lifeless room.  Kind of sounds like my soul! hah! ehhem..... Folks don't come around here anymore, ever since the old king lost his wits.  Shame, I tell ya! By my troth, the king used to be a honorable and respected man!"},"text3":"Select [1] to start game.","item1Description":"A sharp sword made of the finest iron","text4":"Select [2] to quit game.","text1":"You made it, the castle looks old and abandoned, but is an immaculate piece of architecture. There is an uneasy feeling in the air, a rush of wind picks up the leaves around you. Will you be the first to claim King Berengars treasure? Or will you join the cursed souls that linger within...","text2":"Welcome to Maledictus.  A game created by Lefties.","npc1dialogue":"I knew I had it on in the kitchen before I prepared the stone oven to heat up a civet.","room5":"Great Hall hallway","npc4":"Soldier","room6":"Guard room","npc3":"Ballroom ghost","room3":"Courtyard","npc2":"Ghost woman","room4":"Ball room","room4Description":"Crystal chandeliers spiral down from the arched sky-blue ceiling illuminating the luxurious golden walls and a floor so polished it looks like an iced-over lake.","npc1":"Ghost man","room9":"Foyer","room7":"Library","npc6":"Prisoner","room8":"Secret room","npc5":"Librarian","npc5dialogue":{"dialogue3":"The curse? Yeah I'm not sure if you noticed but a human is not supposed to be translucent. It's been this way ever since King Berengar came back from his last expedition 200 years ago. The king seems to have gotten the worst of it, he hasn't been the same ever since...","dialogue2":"If you want to go down to the dungeon you will need a key. But I don't have it! I hid it away! Isn't it already bad enough I have to be near the entrance? Why would I want to let whatever is down there up here? It's locked for a reason.. death, death and more death... no thank you. I mean it's almost as bad as the ballroom, too many people and not enough books, that is the LAST place I would want to be right now. The only benefit of the ballroom is that if you hide something there they wouldn't think to bring it here. Ballroom people and libraries just don't mix.","dialogue1":"Look, I'm very busy, I have read every book at least 10,038... *closes book* okay make that 10,039 times, and I am still not any closer to figuring out a cure for this treacherous curse."},"room1":"Dining room","room1Description":"A long, rectangular dining table set with the finest silver cutlery and porcelain tableware fills the room.  A fireplace is built into the east wall behind the head of the table.  A large, crystal chandelier hangs perfectly centered in the room.","room2":"Kitchen","room0":"Great Hall","item3Description":"A sharp pointy spear made of the finest iron","roomDirection1":{"north":"Kitchen","west":"Great Hall"},"roomDirection0":{"east":"Dining room","north":"Courtyard","west":"Great Hall hallway"},"room10":"Dungeon","roomDirection3":{"south":"Great Hall","north":"Ball room"},"room11":"Cellar","roomDirection2":{"south":"Dining room"},"room12":"Crypt","room6Description":"A place where arms and military equipment are stored. You see a ghostly soldier sitting in a wooden chair.","room9Description":"A large, vacant room dimly lit by a few torches lining the stone walls.  You feel an immediate drop in temperature as a freezing chill crawls up your back. You get the sense that this may be your last chance to turn back from what lies ahead...","room11Description":"You see rows of Wine racks as far as the eye can see. A large layer of dust sits atop the exposed wine bottles. You hear a bottle smash in the distance. You are not alone in here...","room7Description":"You see book shelves throughout the room, and at the center of it all, you see a ghostly librarian sitting on the floor with a sea of books scattered around him. He seems to be reading something.","room8Description":"Description placeholder for secret room","roomDirection9":{"east":"Dungeon","south":"Library"},"roomDirection8":{"north":"Library"},"room12Description":"Description placeholder for the crypt.","roomDirection10":{"east":"Crypt","north":"Cellar","west":"Foyer"},"roomDirection11":{"south":"Dungeon"},"item4":"Brass Key","room0Description":"The main area of the castle.","roomDirection4":{"south":"Courtyard"},"roomDirection12":{"west":"Dungeon"},"item3":"Iron Spear","roomDirection7":{"east":"Great Hall hallway","south":"Secret room","north":"Foyer"},"npc2dialogue":"I can't believe you lost it!  After all these years...hundreds of years! I told you to never take it off.  Where did you last see it?","roomDirection6":{"south":"Great Hall hallway"}}